# UNION in MySQL
The `UNION` operator is used to combine the result sets of two or more `SELECT` statements into a single result.

It helps when:

- You're pulling <b>similar data<b> from different tables.
- You want to <b>merge results</b> from multiple queries into one list.

--- 
## When `UNION` Works
1. Same number of columns in all `SELEC`T statements.
2. <b>Compatible data types</b> in corresponding columns.
3. Columns will be matched by position, not by name.
```sql
SELECT name, city FROM customers
UNION
SELECT name, city FROM vendors;
```

This combines names and cities from both tables into a single result.

---

## When `UNION` Doesn't Work
- If the number of columns is different:
```sql
-- This will throw an error
SELECT name, city FROM customers
UNION
SELECT name FROM vendors;
```
- If the data types don’t match:
```sql
-- Error if 'age' is an integer and 'name' is a string
SELECT age FROM users
UNION
SELECT name FROM students;
```
MySQL will complain that the columns can't be matched due to type mismatch.

---

## `UNION` vs `UNION ALL`
By default, `UNION` removes duplicate rows. If you want to keep duplicates, use `UNION ALL`:
```sql
SELECT name FROM students
UNION ALL
SELECT name FROM alumni;
```
Use `UNION` if:

- You want a clean list without duplicates.
Use `UNION ALL` if:

- You want performance and don’t care about duplicates.
- Or you expect duplicate values and want to preserve them.

--- 

### Practical Use Case Example
Let’s say you have two tables: `students_2023` and `students_2024`.
```sql
SELECT name, batch FROM students_2023
UNION
SELECT name, batch FROM students_2024;
```
This gives a combined list of all students across both years, without duplicates.


--- 
## Sorting the Combined Result
You can sort the final output using `ORDER BY` at the end:
```sql
SELECT name FROM students_2023
UNION
SELECT name FROM students_2024
ORDER BY name;
```